# Mission 1

Display the following information [for this dataset](https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user).
- The last 5 rows
- The first 5 rows
- The type of each column

Note : start coding something by typing `pd.read_csv()` and explore the different options available, especially the `sep` parameter.

In [1]:
import pandas as pd

line = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user"

col_names = [
    "index",
    "age",
    "gender",
    "job_title",
    "zipcode",
]

df = pd.read_csv(line, sep="|", names=col_names)
df.drop("index", axis=1, inplace=True)
print(f"Total lenght df : {len(df)} rows\n")
print(f"5 first rows :\n{'-'*14}\n{df.head(5).to_markdown()}\n")
print(f"5 last rows :\n{'-'*14}\n{df.tail(5).to_markdown()}\n")
print(f"Columns Types :\n{'-'*14}\n{df.dtypes.to_markdown()}\n")

Total lenght df : 943 rows

5 first rows :
--------------
|    |   age | gender   | job_title   |   zipcode |
|---:|------:|:---------|:------------|----------:|
|  0 |    24 | M        | technician  |     85711 |
|  1 |    53 | F        | other       |     94043 |
|  2 |    23 | M        | writer      |     32067 |
|  3 |    24 | M        | technician  |     43537 |
|  4 |    33 | F        | other       |     15213 |

5 last rows :
--------------
|     |   age | gender   | job_title     |   zipcode |
|----:|------:|:---------|:--------------|----------:|
| 938 |    26 | F        | student       |     33319 |
| 939 |    32 | M        | administrator |     02215 |
| 940 |    20 | M        | student       |     97229 |
| 941 |    48 | F        | librarian     |     78209 |
| 942 |    22 | M        | student       |     77841 |

Columns Types :
--------------
|           | 0      |
|:----------|:-------|
| age       | int64  |
| gender    | object |
| job_title | object |
| zipcode   | object |

# Mission 2

Display the first 10 rows [in the following file](https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv)

In [2]:
line = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv"

df = pd.read_csv(line)
print(df.head(10).to_markdown())

|    | country           |   beer_servings |   spirit_servings |   wine_servings |   total_litres_of_pure_alcohol | continent     |
|---:|:------------------|----------------:|------------------:|----------------:|-------------------------------:|:--------------|
|  0 | Afghanistan       |               0 |                 0 |               0 |                            0   | Asia          |
|  1 | Albania           |              89 |               132 |              54 |                            4.9 | Europe        |
|  2 | Algeria           |              25 |                 0 |              14 |                            0.7 | Africa        |
|  3 | Andorra           |             245 |               138 |             312 |                           12.4 | Europe        |
|  4 | Angola            |             217 |                57 |              45 |                            5.9 | Africa        |
|  5 | Antigua & Barbuda |             102 |               128 |              45 |                            4.9 | North America |
|  6 | Argentina         |             193 |                25 |             221 |                            8.3 | South America |
|  7 | Armenia           |              21 |               179 |              11 |                            3.8 | Europe        |
|  8 | Australia         |             261 |                72 |             212 |                           10.4 | Oceania       |
|  9 | Austria           |             279 |                75 |             191 |                            9.7 | Europe        |

Set the "country" column as the index for the dataframe, using `set_index` method.

In [3]:
df = df.set_index("country")
df

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
Afghanistan,0,0,0,0.0,Asia
Albania,89,132,54,4.9,Europe
Algeria,25,0,14,0.7,Africa
Andorra,245,138,312,12.4,Europe
Angola,217,57,45,5.9,Africa
...,...,...,...,...,...
Venezuela,333,100,3,7.7,South America
Vietnam,111,2,1,2.0,Asia
Yemen,6,0,0,0.1,Asia
Zambia,32,19,4,2.5,Africa
Zimbabwe,64,18,4,4.7,Africa

# Mission 3

Access the values of the row for **Zimbabwe** (use the index value)

In [4]:
zim = df.loc["Zimbabwe"]
print(zim)

beer_servings                       64
spirit_servings                     18
wine_servings                        4
total_litres_of_pure_alcohol       4.7
continent                       Africa
Name: Zimbabwe, dtype: object

# Mision 4

Display only the "continent" column value for the country **Zimbabwe**.

In [5]:
print(f"The continent of {zim.name} is {zim.continent}")

The continent of Zimbabwe is Africa

# Mission 5

Rename the columns [of this dataset](https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv), try using the following 2 different methods to achieve this:
- Setting column names directly when reading the file
- Editing after creating the dataframe ([This resource could be useful](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html))

In [6]:
line = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv"

col_name = [
    "City_m",
    "Color_m",
    "Shape_m",
    "State_m",
    "Time_m"
]

dfo = pd.read_csv(line, names=col_name, header=0)
print("Method 1 :")
print(dfo)
print("-"*80)

new_name = {
    "City_m" : "City_mod",
    "Color_m" : "Color_mod",
    "Shape_m" : "Shape_mod",
    "State_m" : "State_mod",
    "Time_m" : "Time_mod",
}

dfo.rename(columns=new_name, inplace=True)
print("Method 2 :")
print(dfo)

Method 1 :
                     City_m Color_m   Shape_m State_m            Time_m
0                    Ithaca     NaN  TRIANGLE      NY    6/1/1930 22:00
1               Willingboro     NaN     OTHER      NJ   6/30/1930 20:00
2                   Holyoke     NaN      OVAL      CO   2/15/1931 14:00
3                   Abilene     NaN      DISK      KS    6/1/1931 13:00
4      New York Worlds Fair     NaN     LIGHT      NY   4/18/1933 19:00
...                     ...     ...       ...     ...               ...
18236            Grant Park     NaN  TRIANGLE      IL  12/31/2000 23:00
18237           Spirit Lake     NaN      DISK      IA  12/31/2000 23:00
18238           Eagle River     NaN       NaN      WI  12/31/2000 23:45
18239           Eagle River     RED     LIGHT      WI  12/31/2000 23:45
18240                  Ybor     NaN      OVAL      FL  12/31/2000 23:59

[18241 rows x 5 columns]
--------------------------------------------------------------------------------
Method 2 :
                   City_mod Color_mod Shape_mod State_mod          Time_mod
0                    Ithaca       NaN  TRIANGLE        NY    6/1/1930 22:00
1               Willingboro       NaN     OTHER        NJ   6/30/1930 20:00
2                   Holyoke       NaN      OVAL        CO   2/15/1931 14:00
3                   Abilene       NaN      DISK        KS    6/1/1931 13:00
4      New York Worlds Fair       NaN     LIGHT        NY   4/18/1933 19:00
...                     ...       ...       ...       ...               ...
18236            Grant Park       NaN  TRIANGLE        IL  12/31/2000 23:00
18237           Spirit Lake       NaN      DISK        IA  12/31/2000 23:00
18238           Eagle River       NaN       NaN        WI  12/31/2000 23:45
18239           Eagle River       RED     LIGHT        WI  12/31/2000 23:45
18240                  Ybor       NaN      OVAL        FL  12/31/2000 23:59

[18241 rows x 5 columns]

# Mission 6

Select the first 3 rows and all the columns of the dataframe using iloc

In [7]:
dfo.iloc[: 3]

      City_mod Color_mod Shape_mod State_mod         Time_mod
0       Ithaca       NaN  TRIANGLE        NY   6/1/1930 22:00
1  Willingboro       NaN     OTHER        NJ  6/30/1930 20:00
2      Holyoke       NaN      OVAL        CO  2/15/1931 14:00

# Mission 7

Achieve the same result as in mission 6 by using loc

In [8]:
dfo.loc[: 2]

      City_mod Color_mod Shape_mod State_mod         Time_mod
0       Ithaca       NaN  TRIANGLE        NY   6/1/1930 22:00
1  Willingboro       NaN     OTHER        NJ  6/30/1930 20:00
2      Holyoke       NaN      OVAL        CO  2/15/1931 14:00